//====================================================================
// Windowがリサイズされた時に指定関数を実行
// ※同じ処理が重複した場合は最後だけが実行されます。
//====================================================================
(function($){
    $.fn.dspResizeFunc = function (options) {

		//============================================================
		// 変数定義
		//============================================================
		var defaults = {
			delay: 0,
			func: function(){
			},
		};
		// タイマーID
		var delayed = null;

		// オプションを取得
		var options = $.extend(defaults,options);

		// リサイズイベントを登録
		$(window).bind( "resize", function(){
			eventResize( );
		});

		//============================================================
		// リサイズイベント
		//============================================================
		function eventResize( )
		{
			//========================================================
			if ( options.delay <= 0 )
			{
				//=== dilayがない時は即実行 ==========================
				options.func();
			}
			else
			{
				//=== 遅延実行 =======================================
				if ( !delayed )
				{
					// 保留されいるので以前のリクエストをクリア
					clearTimeout( delayed );
					delayed = null;
				}

				// 遅延実行登録
				delayed = setTimeout( options.func, options.delay );
			}
		}

		//============================================================
		return this;
	}
})(jQuery);
