<?php
//====================================================================
//====================================================================
//====================================================================
//
// DS-Portal 用 Widget
//
//	ITMedia 専用 RSSリーダー
//
//====================================================================
//====================================================================
//====================================================================
require_once( dirname(__FILE__) . '/rss.php' );
class CITMedia extends CRss
{
	//================================================================
	// コンストラクタ
	//================================================================
	public function __construct( $strUser, $aryConfig )
	{
		//=== デフォルトインプリメンテーションの呼び出し =============
		parent::__construct( $strUser, $aryConfig );
	}

	//================================================================
	// URLを取得
	//================================================================
	public function mixGetFeedURL( )
	{
//		return 'http://rss.rssad.jp/rss/itmplusd/2.0/plusd.xml';
//		return 'https://rss.itmedia.co.jp/rss/2.0/pcuser.xml';
		return 'https://rss.itmedia.co.jp/rss/2.0/plusd.xml';
	}

	//================================================================
	//! 1つ分のアイテム情報を作成
	//! @param  SimpleXMLElement $objItem
	//! @return	array( 
	//!			  'TITLE' => [タイトル  ]
	//!			, 'LINK'  => [リンク先  ]
	//!			, 'DATE'  => [配信日時  ]
	//!			, 'AGO'   => [経過時間  ]
	//!			, 'DESC'  => [記事の内容]
	//!			, 'CLASS' => [既読時に付けるclass属性]
	//!		);
	//================================================================
	public function aryMakeItem( $objItem )
	{
		// デフォルトインプリメンテーションの呼び出し
		$aryRet = parent::aryMakeItem( $objItem );
		if ( empty( $aryRet ) ) {
			return $aryRet;
		}

		// タイトルが 'AD: ' で始まるものは無視
		if ( preg_match( '/^AD: /ius', $aryRet['TITLE'] ) === 1 ) {
			return NULL;
		}

		//============================================================
		return $aryRet;
	}
}
?>