<?php
//====================================================================
//====================================================================
//====================================================================
//!
//! @file    ajax.php
//! @brief   AJAX エントリー
//! @author  木屋 善夫
//! @date    2014-03-08
//! @version $Revision: $
//!
//! Copyright (C) 2014 Yoshio Kiya  All rights reserved.
//!
//====================================================================
//====================================================================
//====================================================================

//=== インクルード ===================================================
require_once( '../libkya/KyaApp.php' );
require_once( './config.php' );

//====================================================================
//! main関数
//====================================================================
class CAjaxApp extends CKyaAppHttp
{
	//================================================================
	/**
	 * 構築
	 * @access    public
	*/
	//================================================================
	public function __construct( )
	{
		//=== デフォルトインプリメンテーションの呼び出し =============
		parent::__construct( );
	}

	//================================================================
	/**
	 * 消滅
	 * @access    public
	*/
	//================================================================
	public function __destruct( )
	{
		//=== デフォルトインプリメンテーションの呼び出し =============
		parent::__destruct( );
	}

	//================================================================
	// アトリビュート(定数)
	//================================================================

	//================================================================
	// アトリビュート(変数)
	//================================================================

	//================================================================
	/**
	 * 初期化
	 * @access    public
	 * @retval    FALSE エラー
	*/
	//================================================================
	public function blInit( )
	{
		//=== デフォルトインプリメンテーションの呼び出し =============
		if ( !parent::blInit( ) )
			return FALSE;

		//============================================================
		return TRUE;
	}

	//================================================================
	/**
	 * 処理
	 * @access    public
 	*/
	//================================================================
	public function Run( )
	{
		//=== ファイル名のベース名取得 ===============================
		// URLのファイル名をクエリーに格納している
		// RewriteRule ^([^/]+)/(.*)\.(html|php)$ /$1.php?NAME=$2&%1 [L]
		$strDir      = 'ajax';
		$strName     = $_REQUEST['NAME'];
		$strPHPName  = "./{$strDir}/{$strName}.php";

		//============================================================
		if ( !file_exists( $strPHPName ) )
		{
			//=== .php がなければエラー ==============================
			header("HTTP/1.1 404 Not Found");
			return;
		}

		//============================================================
		if ( !empty( $_SESSION['CIndex.m_iLoginLevel'] ) )
			$strUser = $_SESSION['CIndex.m_rowUser']['V_EMAIL'];
		else
			$strUser = 'default';

		$aryConfig = aryGetConfig( $strUser );

		//=== パラメーターを取得 =====================================
		$strJson  = file_get_contents( 'php://input' );
		DLOG( '$strJson', $strJson );
		$aryParam = json_decode( $strJson, true );
		if ( empty( $aryParam ) )
			$aryParam = $_REQUEST;
		DLOG( '$aryParam', $aryParam );

		//=== 個別の処理を実行 ===================================
		// ※個別処理の結果は標準出力に出してください
		require_once( $strPHPName );
		DLOG( "call aryProcAjax()" );
		$aryRes = aryProcAjax( $strUser, $aryConfig, $aryParam );
		DLOG( '$aryRes', $aryRes );

		//============================================================
		$strCallback = htmlspecialchars( $_GET['callback'] );
		$aryRes = json_encode( $aryRes );

		//============================================================
		$strRes = "{$strCallback}({$aryRes})";

		//============================================================
		header('Content-Type: application/javascript; charset=utf-8');
		echo $strRes;
	}
}

//====================================================================
new CAjaxApp( );
objGetApp( )->Exec( );
?>