<?php
//====================================================================
//====================================================================
//====================================================================
//!
//! @file    test.php
//! @brief   テスト
//! @author  木屋 善夫
//! @date    2014-03-08
//! @version $Revision: $
//!
//! Copyright (C) 2014 Yoshio Kiya  All rights reserved.
//!
//====================================================================
//====================================================================
//====================================================================

//=== インクルード ===================================================
require_once( '../libkya/KyaApp.php' );
require_once( './config.php' );

//====================================================================
//! main関数
//====================================================================
class CTestApp extends CKyaAppHttp
{
	//================================================================
	/**
	 * 構築
	 * @access    public
	*/
	//================================================================
	public function __construct( )
	{
		//=== デフォルトインプリメンテーションの呼び出し =============
		parent::__construct( );
	}

	//================================================================
	/**
	 * 消滅
	 * @access    public
	*/
	//================================================================
	public function __destruct( )
	{
		//=== デフォルトインプリメンテーションの呼び出し =============
		parent::__destruct( );
	}

	//================================================================
	// アトリビュート(定数)
	//================================================================

	//================================================================
	// アトリビュート(変数)
	//================================================================
	public $m_aryTest = array( );

	//================================================================
	/**
	 * 初期化
	 * @access    public
	 * @retval    FALSE エラー
	*/
	//================================================================
	public function blInit( )
	{
		//=== デフォルトインプリメンテーションの呼び出し =============
		if ( !parent::blInit( ) )
			return FALSE;

		//============================================================
		return TRUE;
	}

	//================================================================
	/**
	 * 処理
	 * @access    public
 	*/
	//================================================================
	public function Run( )
	{
		//=== ファイル名のベース名取得 ===============================
		// URLのファイル名をクエリーに格納している
		// RewriteRule ^parts/(.*)\.html$ /parts.php?NAME=$1 [L]
		$strName      = $_REQUEST['NAME'];
		$strPHPName   = "./test/{$strName}.php";
		$strHTMLName  = "./test/{$strName}.html";
		$strFrameName = './test/frame.html';

		//============================================================
		if ( file_exists( $strPHPName ) )
		{
			//=== 個別の処理を実行 ===================================
			// ※個別処理の結果は標準出力に出してください
			ob_start( );
			require_once( $strPHPName );
//			EchoContents( );
			$strBody = ob_get_clean( );
		}
		else if ( file_exists( $strHTMLName ) )
		{
			//=== 静的ページの出力 ===================================
			$strBody = file_get_contents( $strHTMLName );
		}
		else
		{
			//=== .php .html ともになければエラー ====================
			header("HTTP/1.1 404 Not Found");
			return;
		}

		//=== 結果をフレームと合成 ===================================
		if ( file_exists( $strFrameName ) )
		{
			//=== フレームがあるので合成 =============================
			$strFrame = file_get_contents( $strFrameName );
			$strHTML = str_replace( '<!-- body -->', $strBody, $strFrame );
		}
		else
		{
			//=== フレームがないのでそのまま出力 =====================
			$strHTML = $strBody;
		}

		//============================================================
		echo $strHTML;
	}
}

//====================================================================
new CTestApp( );
objGetApp( )->Exec( );
?>